Revit 2027 API
CableTrayType.BendMultiplier Property
 Bend multiplier.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BendMultiplier { get; set; }
Public Property BendMultiplier As Double
	Get
	Set
public:
property double BendMultiplier {
	double get ();
	void set (double value);
}
member BendMultiplier : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The bend multiplier value should be positive and less than 3000.
Remarks
 This should be positive and less than 3000.
See Also
Reference
CableTrayType Class
Autodesk.Revit.DB.Electrical Namespace